def factorial_recursive(n): #შექმნილია ფუნქცია სახელად factorial_recursive  და ის პარამეტრად იღებს n_ს.
      if n < 0: #აქ ამოწმებს რიცხვი არის თუ არა 0_ზე ნაკლები, ანუ შეგვიძლია გავიგოთ რიცხვი დადებითია თუ უარყოფითი.
          return "Factorial is not defined for negative numbers." #თუ რიცხვი უარყოფითი აღმოჩნდება დააბრუნებს ამ ტექტურ შეტყობინებას.
    
      if n == 0 or n == 1: #აქ ამოწმებს რიცხვი 0_ის ან 1_ის ტოლი არის თუ არა. აქ არის საბაზისო შემთხვევა.
        return 1 #რიცხვი თუ იქნება ერთის ან ნულის ტოლი უნდა დააბრუნოს 1.
    
   
      return n * factorial_recursive(n - 1) #ფუნქცია ამრავლებს რიცხვს თავის გამოძახებაზე რომლის არგუმენტიც არის n-1, ანუ რიცხვს გამოკლებული 1.
#ფუნქცია საბოლოო პასუხს იგებს ზემოდან ქვემოთ ამოხსნის პრინციპით და შემდეგ პასუხებს იღებენ ქვემოდან ზემოთ.
print(factorial_recursive(5))   # აქ ხდება ფუნქციის გამოძახება რიცხვი 5_ისთვის  და დაბეჭდავს 120_ს.
print(factorial_recursive(0))  #აქ ფუნქციის გამოძახება ხდება 0_ისთვის და დაბეჭდავს 1_ს
